Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateHasNoValueParameterRule(Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether an element's parameter does not have a value.
parameter:
The parameter to be evaluated by the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateHasValueParameterRule(Autodesk.Revit.DB.ElementId)
Creates a filter rule that determines whether an element's parameter has a value.
parameter:
The parameter to be evaluated by the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020